# 👇実際これだけでもbuildは、できる。
FROM ubuntu:20.04

# shellで実行したいコマンドをRUNで指定できる。
# dockerfileを実行してイメージを作成する際にapt updateを実行してくれるという指定
# つまり、apt updateを実行した状態のイメージを手にいれることができる。
RUN apt update

# ーyは、なんなのか？　これシンプルに --yesの略
RUN apt install -y curl 

# 環境変数を設定 ←そもそも環境変数ってなに？
# ダブルクオートで過去っているりゆとしては、間にスペースが入っていてどこからどこが文字列か判断するためとのこと。
ENV hello="Hello World"

# ARGでも変数を指定できるがイメージ作成時のみ有効な一時的な変数
# ARG

WORKDIR /app







# CMDは、dockerfileで一度しか使えない
# コンテナ実行時のデフォルトコマンドを設定するもの
# 複数のCMDがあれば、最後のCMDのみ有効になって基本的には上書きされるとのこと。
# 👇以下にすることでデフォルトのコマンドがCMDで設定したものになる。
# オプションは、
CMD ["ls","-la"]





